# Pandas Methods 
### Objectives:
- We will learn how to use pandas dataframe methods
  (mean, median, sum, min, max, cumsum, cummax 
  or any method that works with np)
- We will learn how to use custom dataframe methods
- We will count the categorical variables
- We will group dataframes by columns
- We will learn to use pivot tables for data analysis

In [1]:
import pandas as pd
import os

pd.__version__

'2.2.2'

In [2]:
root_dir = os.path.dirname(os.getcwd())
data_dir = os.path.join(root_dir, "Datasets")
dataset_path = os.path.join(data_dir, "sales_subset.csv")
print("root_dir", root_dir)
print("data_dir", data_dir)
print("dataset_path", dataset_path)

root_dir f:\bongoDev ML Course\000.Exercises\BongoDev ML Course Practise
data_dir f:\bongoDev ML Course\000.Exercises\BongoDev ML Course Practise\Datasets
dataset_path f:\bongoDev ML Course\000.Exercises\BongoDev ML Course Practise\Datasets\sales_subset.csv

In [3]:
sales = pd.read_csv(dataset_path)
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [4]:
sales = sales.drop(columns=['Unnamed: 0'])
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [5]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10774 entries, 0 to 10773
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   store                 10774 non-null  int64
 1   type                  10774 non-null  object
 2   department            10774 non-null  int64
 3   date                  10774 non-null  object
 4   weekly_sales          10774 non-null  float64
 5   is_holiday            10774 non-null  bool
 6   temperature_c         10774 non-null  float64
 7   fuel_price_usd_per_l  10774 non-null  float64
 8   unemployment          10774 non-null  float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 684.0+ KB

# Pandas Methods

In [6]:
sales["weekly_sales"].mean()

np.float64(23843.95014850566)

In [7]:
import numpy as np

np.mean(sales["weekly_sales"])

np.float64(23843.95014850566)

In [8]:
print("mean", sales["weekly_sales"].mean())
print("median", sales["weekly_sales"].median())
print("max", sales["date"].max())
print("min", sales["date"].min())
print("sum", sales['weekly_sales'].sum())

mean 23843.95014850566
median 12049.064999999999
max 2012-10-26
min 2010-02-05
sum 256894718.89999998

# What is cumsum?

In [9]:
""" 
1, 2, 3, 4, 5
1, 3, 6, 10, 15 (cumulative sum)


1, -1, 8, -3, 10
1, 1, 8, 8, 10 (cumulative max)
"""

sales["weekly_sales"].cumsum()

0        2.492450e+04
1        4.675240e+04
2        1.040108e+05
3        1.214248e+05
4        1.389829e+05
             ...
10769    2.568930e+08
10770    2.568934e+08
10771    2.568938e+08
10772    2.568938e+08
10773    2.568947e+08
Name: weekly_sales, Length: 10774, dtype: float64

In [10]:
sales["weekly_sales"].cummax()

0         24924.50
1         24924.50
2         57258.43
3         57258.43
4         57258.43
           ...
10769    293966.05
10770    293966.05
10771    293966.05
10772    293966.05
10773    293966.05
Name: weekly_sales, Length: 10774, dtype: float64

In [11]:
sales[ ["weekly_sales", "fuel_price_usd_per_l"] ].mean()

weekly_sales            23843.950149
fuel_price_usd_per_l        0.749746
dtype: float64

# Normalize

In [13]:
""" 
x, y
x = [100000, 200000]
y = [0, 1]

z = 3 * x + 2 * y
x is a dominating variable

normalize = (x - min_x) / (max_x - min_x)
"""

def normalize(col):
    min_val = col.min()
    max_val = col.max()
    return (col - min_val) / (max_val - min_val)

#sales["temperature_c"].agg(normalize)
sales[["temperature_c", "weekly_sales"]].agg([normalize, np.cumsum])

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3416182909.py:18: FutureWarning: The provided callable <function cumsum at 0x000002DA36FE5260> is currently using Series.cumsum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "cumsum" instead.
  sales[["temperature_c", "weekly_sales"]].agg([normalize, np.cumsum])

      temperature_c                weekly_sales
          normalize         cumsum    normalize        cumsum
0          0.334036       5.727778     0.088193  2.492450e+04
1          0.389203      13.783333     0.077698  4.675240e+04
2          0.596840      30.600000     0.197775  1.040108e+05
3          0.732192      53.127778     0.062739  1.214248e+05
4          0.839368      80.177778     0.063227  1.389829e+05
...             ...            ...          ...           ...
10769      0.426860  169405.211111     0.006754  2.568930e+08
10770      0.576037  169421.150000     0.004907  2.568934e+08
10771      0.845030  169448.438889     0.005246  2.568938e+08
10772      0.806057  169474.083333     0.003721  2.568938e+08
10773      0.725609  169496.333333     0.006822  2.568947e+08

[10774 rows x 4 columns]

In [14]:
sales[["temperature_c", "weekly_sales"]].agg([np.min, np.max, np.mean])

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3415823201.py:1: FutureWarning: The provided callable <function min at 0x000002DA36FE56C0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales[["temperature_c", "weekly_sales"]].agg([np.min, np.max, np.mean])
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3415823201.py:1: FutureWarning: The provided callable <function max at 0x000002DA36FE5580> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales[["temperature_c", "weekly_sales"]].agg([np.min, np.max, np.mean])
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3415823201.py:1: FutureWarning: The provided callable <function mean at 0x000002DA36FE5F80> is currently using Series.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales[["temperature_c", "weekly_sales"]].agg([np.min, np.max, np.mean])

      temperature_c   weekly_sales
min       -8.366667   -1098.000000
max       33.827778  293966.050000
mean      15.731978   23843.950149

In [15]:
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

# Counting categorical values

In [16]:
"""  
- Can numerical values be categorical?
- i.e. rating
- rating: 1, 2, 3,4,  5
"""

sales["type"].value_counts()

type
A    9872
B     902
Name: count, dtype: int64

In [17]:
sales['store'].value_counts(ascending=True)

store
39    875
14    885
31    890
6     894
2     897
27    900
4     901
1     901
10    902
19    906
20    910
13    913
Name: count, dtype: int64

# Group By

In [18]:
sales_grouped_type = sales.groupby('type')
sales_grouped_type.sum()

,store,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
type,,,,,,,,
A,157351,446903,2010-02-052010-03-052010-04-022010-05-072010-0...,2.337163e+08,40,150363.716667,7350.877448,78705.612
B,9020,40277,2010-02-052010-03-052010-04-022010-05-072010-0...,2.317840e+07,2,19132.616667,726.884274,8369.949

In [19]:
sales_by_type_holiday = sales.groupby(["type", "is_holiday"])
sales_by_type_holiday['weekly_sales'].sum()

# is_holiday: true, false
# type: A, B

# part 1: true, A
# part 2: true, B
# part 3: false, A
# part 4: false, B

sales_by_type_holiday[["weekly_sales"]].sum()

                 weekly_sales
type is_holiday
A    False       2.336927e+08
     True        2.360181e+04
B    False       2.317678e+07
     True        1.621410e+03

In [20]:
sales_stats = sales.groupby("type")["weekly_sales"].agg([min, max, np.mean, np.median])
sales_stats

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\2371551615.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales_stats = sales.groupby("type")["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\2371551615.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales_stats = sales.groupby("type")["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\2371551615.py:1: FutureWarning: The provided callable <function mean at 0x000002DA36FE5F80> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales_stats = sales.groupby("type")["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\2371551615.py:1: FutureWarning: The provided callable <function median at 0x000002DA3712AB60> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  sales_stats = sales.groupby("type")["weekly_sales"].agg([min, max, np.mean, np.median])

         min        max          mean    median
type
A    -1098.0  293966.05  23674.667242  11943.92
B     -798.0  232558.51  25696.678370  13336.08

# index

In [21]:
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [22]:
sales.index

RangeIndex(start=0, stop=10774, step=1)

# Pivot table

In [23]:

sales.pivot_table(
    values=["weekly_sales", "fuel_price_usd_per_l"],
    index="type",
    aggfunc=[np.median]
)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\1141288731.py:1: FutureWarning: The provided callable <function median at 0x000002DA3712AB60> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  sales.pivot_table(

                   median
     fuel_price_usd_per_l weekly_sales
type
A                0.735455     11943.92
B                0.803348     13336.08

In [24]:
mean_sales_by_type_holiday = sales.pivot_table(
    values="weekly_sales", 
    index="type", 
    columns="is_holiday", 
    aggfunc=[min, max, np.mean, np.median]
)

mean_sales_by_type_holiday

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3720738108.py:1: FutureWarning: The provided callable <built-in function min> is currently using DataFrameGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3720738108.py:1: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3720738108.py:1: FutureWarning: The provided callable <function mean at 0x000002DA36FE5F80> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15760\3720738108.py:1: FutureWarning: The provided callable <function median at 0x000002DA3712AB60> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  mean_sales_by_type_holiday = sales.pivot_table(

               min                max                  mean             \
is_holiday   False   True       False   True          False      True
type
A          -1098.0 -598.00  293966.05  5350.0  23768.583523  590.04525
B           -798.0   31.41  232558.51  1590.0  25751.980533  810.70500

               median
is_holiday      False    True
type
A           12028.955   37.500
B           13348.680  810.705

# loc, iloc

In [25]:
dataset_path = os.path.join(data_dir, "temperatures.csv")
print("dataset_path", dataset_path)

dataset_path f:\bongoDev ML Course\000.Exercises\BongoDev ML Course Practise\Datasets\temperatures.csv

In [26]:
temperatures = pd.read_csv(dataset_path)
temperatures = temperatures.drop(columns=['Unnamed: 0'])
temperatures.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [27]:
temperatures.index

RangeIndex(start=0, stop=16500, step=1)

In [28]:
temperatures_indexed_by_city = temperatures.set_index("city")
temperatures_indexed_by_city.head()

               date        country  avg_temp_c
city
Abidjan  2000-01-01  Côte D'Ivoire      27.293
Abidjan  2000-02-01  Côte D'Ivoire      27.685
Abidjan  2000-03-01  Côte D'Ivoire      29.061
Abidjan  2000-04-01  Côte D'Ivoire      28.162
Abidjan  2000-05-01  Côte D'Ivoire      27.547

In [29]:
temperatures_indexed_by_city.index

Index(['Abidjan', 'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan',
       'Abidjan', 'Abidjan', 'Abidjan', 'Abidjan',
       ...
       'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian', 'Xian',
       'Xian'],
      dtype='object', name='city', length=16500)

In [30]:
cities = ["Moscow", "Saint Petersburg"]

In [31]:
temperatures_indexed_by_city.loc[cities]

                        date country  avg_temp_c
city
Moscow            2000-01-01  Russia      -7.313
Moscow            2000-02-01  Russia      -3.551
Moscow            2000-03-01  Russia      -1.661
Moscow            2000-04-01  Russia      10.096
Moscow            2000-05-01  Russia      10.357
...                      ...     ...         ...
Saint Petersburg  2013-05-01  Russia      12.355
Saint Petersburg  2013-06-01  Russia      17.185
Saint Petersburg  2013-07-01  Russia      17.234
Saint Petersburg  2013-08-01  Russia      17.153
Saint Petersburg  2013-09-01  Russia         NaN

[330 rows x 3 columns]

In [32]:
temperatures_indexed_by_city_country = temperatures.set_index(["country", "city"])
temperatures_indexed_by_city_country.head()

                             date  avg_temp_c
country       city
Côte D'Ivoire Abidjan  2000-01-01      27.293
              Abidjan  2000-02-01      27.685
              Abidjan  2000-03-01      29.061
              Abidjan  2000-04-01      28.162
              Abidjan  2000-05-01      27.547

In [33]:
country_city_pairs = [("Bangladesh", "Dhaka"), ("Brazil", "Rio De Janeiro")]

In [34]:
temperatures_indexed_by_city_country.loc[country_city_pairs]

                                 date  avg_temp_c
country    city
Bangladesh Dhaka           2000-01-01      18.829
           Dhaka           2000-02-01      20.947
           Dhaka           2000-03-01      26.035
           Dhaka           2000-04-01      28.545
           Dhaka           2000-05-01      28.684
...                               ...         ...
Brazil     Rio De Janeiro  2013-05-01      24.443
           Rio De Janeiro  2013-06-01      24.703
           Rio De Janeiro  2013-07-01      23.768
           Rio De Janeiro  2013-08-01      23.175
           Rio De Janeiro  2013-09-01         NaN

[330 rows x 2 columns]

In [35]:
temperatures.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [36]:
print(temperatures.iloc[4,1])
print(temperatures.iloc[:5])
print(temperatures.iloc[:,2:4])
print(temperatures.iloc[:5,2:4])

Abidjan
         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547
             country  avg_temp_c
0      Côte D'Ivoire      27.293
1      Côte D'Ivoire      27.685
2      Côte D'Ivoire      29.061
3      Côte D'Ivoire      28.162
4      Côte D'Ivoire      27.547
...              ...         ...
16495          China      18.979
16496          China      23.522
16497          China      25.251
16498          China      24.528
16499          China         NaN

[16500 rows x 2 columns]
         country  avg_temp_c
0  Côte D'Ivoire      27.293
1  Côte D'Ivoire      27.685
2  Côte D'Ivoire      29.061
3  Côte D'Ivoire      28.162
4  Côte D'Ivoire      27.547